In [2]:
import pandas as pd
import numpy as np
array=np.array([3,np.nan,0.4,np.nan])
print(array)

[3.  nan 0.4 nan]

In [29]:
import pandas as pd
import numpy as np
data_string='''Id,Gender,Salary,Country,Company
1,male,12000,indian,google
2,female,150000,italian,alibaba
3,NaN,45000,china,NaN
4,male,NaN,indian,NaN
5,30000,australia,google'''
with open('Salary.csv','w') as out:
    out.write(data_string)

In [35]:
df=pd.read_csv('Salary.csv')
print('Salary Dataset:\n',df)

Salary Dataset:
    Id  Gender     Salary  Country  Company
0   1    male      12000   indian   google
1   2  female     150000  italian  alibaba
2   3     NaN      45000    china      NaN
3   4    male        NaN   indian      NaN
4   5   30000  australia   google      NaN

In [32]:
print('Missing data\n',df.isnull())

Missing data
       Id  Gender  Salary  Country  Company
0  False   False   False    False    False
1  False   False   False    False    False
2  False    True   False    False     True
3  False   False    True    False     True
4  False   False   False    False     True

In [33]:
print('Filter based on column:\n',df[df.isnull().any(axis=1)])

Filter based on column:
    Id Gender     Salary Country Company
2   3    NaN      45000   china     NaN
3   4   male        NaN  indian     NaN
4   5  30000  australia  google     NaN

In [34]:
print('sum up the missing values:\n',df.isnull().sum())

sum up the missing values:
 Id         0
Gender     1
Salary     1
Country    0
Company    3
dtype: int64

In [36]:
df.dropna(inplace=True)
print(df)

   Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [38]:
df["Salary"].fillna(20000,inplace=True)
print(df)

   Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [39]:
print('Non Missing Data\n',df.notnull())

Non Missing Data
      Id  Gender  Salary  Country  Company
0  True    True    True     True     True
1  True    True    True     True     True

In [42]:
print('Drop missing Company Data\n',df.Company.dropna())
df.dropna()

Drop missing Company Data
 0     google
1    alibaba
Name: Company, dtype: object

   Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [44]:
 df.dropna(axis=1)
print(df)

   Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [45]:
new_df=df.dropna(axis=0,how='any')
print(new_df)

   Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [46]:
print('Fill Missing Data\n',df.fillna(0))

Fill Missing Data
    Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [47]:
print('Fill Missing Data\n',df.fillna(method='Pad'))

Fill Missing Data
    Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [50]:
print('Fill Missing Data\n',df.fillna(method="bfill"))

Fill Missing Data
    Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba

In [49]:
gender=pd.isnull(df['Gender'])
gender

0    False
1    False
Name: Gender, dtype: bool

In [51]:
print('Fill Missing Data\n',df["Gender"].fillna("no Gender",inplace=True))

Fill Missing Data
 None

In [53]:
print(df.replace(to_replace='google',value='Microsoft'))

   Id  Gender  Salary  Country    Company
0   1    male   12000   indian  Microsoft
1   2  female  150000  italian    alibaba

In [55]:
print(df.interpolate(method='linear',limit_direction='forward'))

   Id  Gender  Salary  Country  Company
0   1    male   12000   indian   google
1   2  female  150000  italian  alibaba